tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
# Download with resuming and segmented downloading
brew "aria2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat", args: ["HEAD"]
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Collection of portable C++ source libraries
brew "boost"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Object-file caching compiler wrapper
brew "ccache"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker", args: ["HEAD"]
# More intuitive version of du in rust
brew "dust", args: ["HEAD"]
# Modern replacement for 'ls'
brew "exa", args: ["HEAD"]
# Simple, fast and user-friendly alternative to find
brew "fd", args: ["HEAD"]
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf", args: ["HEAD"]
# Distributed revision control system
brew "git", args: ["HEAD"]
# Syntax-highlighting pager for git and diff output
brew "git-delta", args: ["HEAD"]
# AVH edition of git-flow
brew "git-flow-avh", args: ["HEAD"]
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Ping, but with a graph
brew "gping", args: ["HEAD"]
# Command-line benchmarking tool
brew "hyperfine", args: ["HEAD"]
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just", args: ["HEAD"]
# Simple terminal UI for git commands
brew "lazygit", args: ["HEAD"]
# Conversion library
brew "libiconv"
# Linux virtual machines
brew "lima"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Development kit for the Java programming language
brew "openjdk@17"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep", args: ["HEAD"]
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# SMART hard drive monitoring
brew "smartmontools"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Lightweight BitTorrent client
brew "transmission-cli"
# JavaScript toolchain manager for reproducible environments
brew "volta", args: ["HEAD"]
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Internet file retriever
brew "wget"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja", args: ["HEAD"]
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh", args: ["HEAD"]
# Android SDK component
cask "android-platform-tools"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Voice and text chat software
cask "discord-canary"
# Collaborative team software
cask "figma-beta"
# Web browser
cask "firefox-nightly"
cask "font-jf-open-huninn"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-noto-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-sauce-code-pro-nerd-font"
# Early access development kit for the Java programming language
cask "java-beta"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Minecraft launcher
cask "prismlauncher"
# Control your tools with a few keystrokes
cask "raycast"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "AdGuard for Safari", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Keynote", id: 409183694
mas "Lightweight PDF", id: 1450640351
mas "LINE", id: 539883307
mas "LocalSend", id: 1661733229
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PiPifier", id: 1160374471
mas "Save to Pocket", id: 1477385213
mas "Save to Raindrop.io", id: 1549370672
mas "Todoist", id: 585829637
