tap "birdgg/affine"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "modularml/packages"
# General-purpose data compression with high compression ratio
brew "xz"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Download with resuming and segmented downloading
brew "aria2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat", args: ["HEAD"]
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Collection of portable C++ source libraries
brew "boost"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Object-file caching compiler wrapper
brew "ccache"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# GNU File, Shell, and Text utilities
brew "coreutils", link: false
# Secure runtime for JavaScript and TypeScript
brew "deno"
# More intuitive version of du in rust
brew "dust", args: ["HEAD"]
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd", args: ["HEAD"]
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf", args: ["HEAD"]
# GitHub command-line tool
brew "gh", args: ["HEAD"]
# Distributed revision control system
brew "git", args: ["HEAD"]
# Syntax-highlighting pager for git and diff output
brew "git-delta", args: ["HEAD"]
# AVH edition of git-flow
brew "git-flow-avh", args: ["HEAD"]
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Ping, but with a graph
brew "gping", args: ["HEAD"]
# Command-line benchmarking tool
brew "hyperfine", args: ["HEAD"]
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just", args: ["HEAD"]
# Simple terminal UI for git commands
brew "lazygit", args: ["HEAD"]
# Conversion library
brew "libiconv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Improved Nano Syntax Highlighting Files
brew "nanorc", args: ["HEAD"]
# Fast, highly customisable system info script
brew "neofetch", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Modern shell for the GitHub era
brew "nushell", args: ["HEAD"]
# Development kit for the Java programming language
brew "openjdk@17"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep", args: ["HEAD"]
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# SMART hard drive monitoring
brew "smartmontools"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Tool Command Language
brew "tcl-tk"
# Cross-platform Rust rewrite of the GNU coreutils
brew "uutils-coreutils", args: ["HEAD"]
# JavaScript toolchain manager for reproducible environments
brew "volta", args: ["HEAD"]
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Internet file retriever
brew "wget"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja", args: ["HEAD"]
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# General-purpose lossless data-compression library
brew "zlib", args: ["HEAD"]
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh", args: ["HEAD"]
# Android SDK component
cask "android-platform-tools"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Chromium based browser
cask "arc"
# Universal chat app powered by Matrix
cask "beeper"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# OpenJDK distribution from Amazon
cask "corretto8"
cask "font-jf-open-huninn"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-noto-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-sauce-code-pro-nerd-font"
# Java IDE by JetBrains
cask "intellij-idea"
# Early access development kit for the Java programming language
cask "java-beta"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Minecraft launcher
cask "prismlauncher"
# Control your tools with a few keystrokes
cask "raycast"
# Replacement for RCDefaultApps, written in Swift
cask "swiftdefaultappsprefpane"
# Resources for Wacom tablets
cask "wacom-tablet"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "AdGuard for Safari", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "Keynote", id: 409183694
mas "Lightweight PDF", id: 1450640351
mas "LINE", id: 539883307
mas "LocalSend", id: 1661733229
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PiPifier", id: 1160374471
mas "Save to Pocket", id: 1477385213
mas "Save to Raindrop.io", id: 1549370672
mas "Surfshark", id: 1437809329
